In [2]:
import pandas as pd

In [ ]:
#first we start with customers table then discover and clean it

In [4]:
customers = pd.read_csv("/Users/mac/Desktop/Banking_project/raw_data_dirty/bank_customers_dirty.csv")

In [5]:
customers.head()

   customer_id        name  age        city         job marital_status
0            1  Customer_1   56       cairo    engineer        single
1            2  Customer_2   69       cairo      doctor         single
2            3  Customer_3   46  Alexandira  unemployed            NaN
3            4  Customer_4   32       Cairo   developer       divorced
4            5  Customer_5   60  Alexandria     teacher        MARRIED

In [7]:
customers.duplicated().sum()

0

In [11]:
customers.columns =  customers.columns.str.strip().str.title() #1

In [12]:
customers.head()

   Customer_Id        Name  Age        City         Job Marital_Status
0            1  Customer_1   56       cairo    engineer        single
1            2  Customer_2   69       cairo      doctor         single
2            3  Customer_3   46  Alexandira  unemployed            NaN
3            4  Customer_4   32       Cairo   developer       divorced
4            5  Customer_5   60  Alexandria     teacher        MARRIED

In [16]:
customers["City"].value_counts()

City
Cairo         1147
Caiiro        1129
Alexandira    1127
Asyut         1108
Alexandria    1106
cairo         1104
Giza          1100
Mansoura      1092
GIZA          1087
Name: count, dtype: int64

In [22]:
customers["City"]=customers["City"].replace(
    {
        "Caiiro":"Cairo" ,
        "cairo" : "Cairo" ,
        "GIZA" : "Giza" , 
        "Alexandira" : "Alexandria"
    }
) #2

In [23]:
customers["City"].value_counts()

City
Cairo         3380
Alexandria    2233
Giza          2187
Asyut         1108
Mansoura      1092
Name: count, dtype: int64

In [24]:
customers["Job"].value_counts()

Job
unemployed    1480
teacher       1429
developer     1423
banker        1411
doctor        1403
engineer      1399
Name: count, dtype: int64

In [25]:
customers["Job"].isnull().sum()

1455

In [26]:
customers["Job"] = customers["Job"].fillna("unemployed") #3

In [27]:
customers["Job"].isnull().sum()

0

In [28]:
customers["Marital_Status"].value_counts()

Marital_Status
MARRIED     1808
divorced    1681
single      1648
single      1637
married     1605
Name: count, dtype: int64

In [30]:
customers["Marital_Status"] = customers["Marital_Status"].str.strip().str.title()  #4

In [31]:
customers["Marital_Status"].value_counts()

Marital_Status
Married     3413
Single      3285
Divorced    1681
Name: count, dtype: int64

In [32]:
customers["Age"].describe()

count    10000.000000
mean        43.539400
std         14.911636
min         18.000000
25%         31.000000
50%         43.000000
75%         56.000000
max         69.000000
Name: Age, dtype: float64

In [33]:
# customers table is clean now

In [34]:
import pandas as pd 
bank_accounts = pd.read_csv("/Users/mac/Desktop/Banking_project/raw_data_dirty/bank_accounts_dirty.csv")

In [35]:
bank_accounts.head()

   account_id  customer_id account_type   open_date   balance
0           1         8699        fixed  2021-02-16  42067.35
1           2         6248       saving  2015-10-10  17067.56
2           3         8638          NaN  2017-08-28  63089.66
3           4         2782          NaN  2016-05-03  95528.90
4           5          444          NaN  2022-10-24  80654.34

In [37]:
bank_accounts.duplicated().sum()

0

In [38]:
bank_accounts["open_date"] = pd.to_datetime(bank_accounts["open_date"]) #1

In [39]:
bank_accounts["account_type"].value_counts()

account_type
saving     2008
current    1996
fixed      1991
SAVING     1962
Name: count, dtype: int64

In [40]:
bank_accounts["account_type"]= bank_accounts["account_type"].str.lower() #2

In [41]:
bank_accounts["account_type"].value_counts()

account_type
saving     3970
current    1996
fixed      1991
Name: count, dtype: int64

In [43]:
bank_accounts["account_type"]=bank_accounts["account_type"].fillna("saving") #3

In [44]:
bank_accounts["account_type"].value_counts()

account_type
saving     6013
current    1996
fixed      1991
Name: count, dtype: int64

In [45]:
bank_loans = pd.read_csv("/Users/mac/Desktop/Banking_project/raw_data_dirty/bank_loans_dirty.csv")

In [46]:
bank_loans.head()

   loan_id  customer_id loan_type  loan_amount  installments  loan_status
0        1         3899  Personal     13970.96            29  in_progress
1        2         7054       NaN     46669.49            26      default
2        3          589  personal     45194.35            40      default
3        4         1662  personal     41004.32            46      default
4        5         7512  business      8303.01            14          NaN

In [47]:
bank_loans.duplicated().sum()

0

In [48]:
bank_loans["loan_type"].value_counts()

loan_type
auto        1753
mortgage    1700
business    1664
Personal    1610
personal    1603
Name: count, dtype: int64

In [49]:
bank_loans["loan_type"] = bank_loans["loan_type"].str.strip().str.title()  #1

In [50]:
bank_loans["loan_type"].value_counts()

loan_type
Personal    3213
Auto        1753
Mortgage    1700
Business    1664
Name: count, dtype: int64

In [51]:
bank_loans["loan_status"].value_counts()

loan_status
default        1708
PAID           1682
in_progress    1656
paid           1643
defaulted      1642
Name: count, dtype: int64

In [52]:
bank_loans["loan_status"] = bank_loans["loan_status"].str.strip().str.title() #2

In [53]:
bank_loans["loan_status"].value_counts()

loan_status
Paid           3325
Default        1708
In_Progress    1656
Defaulted      1642
Name: count, dtype: int64

In [54]:
bank_loans["loan_type"] = bank_loans["loan_type"].fillna("Personal") #3

In [55]:
bank_loans["loan_status"].isnull().sum()

1669

In [56]:
bank_loans["loan_status"] = bank_loans["loan_status"].fillna("Defaulted") #4

In [57]:
bank_transactions = pd.read_csv("/Users/mac/Desktop/Banking_project/raw_data_dirty/bank_transactions_dirty.csv")

In [58]:
bank_transactions.head()

   transaction_id  account_id transaction_type transaction_date   amount
0               1        8083       withdrawal       2020-06-09  1889.64
1               2        2653          Deposit       2021-09-25  7677.39
2               3        4978         transfer       2022-12-04  1194.58
3               4        3759              NaN       2021-05-10   882.83
4               5        3898          deposit       2020-02-29  6801.89

In [59]:
bank_transactions.isnull().sum()

transaction_id         0
account_id             0
transaction_type    1674
transaction_date       0
amount                 0
dtype: int64

In [60]:
bank_transactions.duplicated().sum()

0

In [61]:
bank_transactions["transaction_date"] = pd.to_datetime(bank_transactions["transaction_date"]) #1

In [62]:
bank_transactions["transaction_type"].value_counts()

transaction_type
deposit       1718
transfer      1685
withdraw      1657
withdrawal    1643
Deposit       1623
Name: count, dtype: int64

In [64]:
bank_transactions["transaction_type"]=bank_transactions["transaction_type"].str.strip().str.title() #2

In [65]:
bank_transactions["transaction_type"].value_counts()

transaction_type
Deposit       3341
Transfer      1685
Withdraw      1657
Withdrawal    1643
Name: count, dtype: int64

In [68]:
bank_transactions["transaction_type"]=bank_transactions["transaction_type"].replace({
    "Withdrawal" : "Withdraw"
}) #3

In [69]:
bank_transactions["transaction_type"].value_counts()

transaction_type
Deposit     3341
Withdraw    3300
Transfer    1685
Name: count, dtype: int64

In [72]:
bank_transactions[bank_transactions["amount"]<0]

Empty DataFrame
Columns: [transaction_id, account_id, transaction_type, transaction_date, amount]
Index: []

In [74]:
# Fill missing transaction_type with 'Unknown' since we can't infer it from other fields
bank_transactions["transaction_type"] = bank_transactions["transaction_type"].fillna("Unknown")

In [75]:
bank_complaints = pd.read_csv("/Users/mac/Desktop/Banking_project/raw_data_dirty/bank_complaints_dirty.csv")

In [76]:
bank_complaints.head()

   complaint_id  customer_id complaint_type complaint_date       status
0             1         3830        service     2022-12-01  in_progress
1             2          596           loan     2022-05-13  in_progress
2             3           78    transaction     2021-12-17  in_progress
3             4         1296        service     2023-05-01      pending
4             5         7061    Transaction     2022-01-04      pending

In [77]:
bank_complaints["complaint_date"] = pd.to_datetime(bank_complaints["complaint_date"]) #1

In [78]:
bank_complaints["complaint_type"].value_counts()

complaint_type
service        1449
Transaction    1430
transaction    1425
loan           1399
other          1391
Name: count, dtype: int64

In [79]:
bank_complaints["complaint_type"] = bank_complaints["complaint_type"].str.strip().str.title() #2

In [80]:
bank_complaints["complaint_type"].value_counts()

complaint_type
Transaction    2855
Service        1449
Loan           1399
Other          1391
Name: count, dtype: int64

In [81]:
bank_complaints.head()

   complaint_id  customer_id complaint_type complaint_date       status
0             1         3830        Service     2022-12-01  in_progress
1             2          596           Loan     2022-05-13  in_progress
2             3           78    Transaction     2021-12-17  in_progress
3             4         1296        Service     2023-05-01      pending
4             5         7061    Transaction     2022-01-04      pending

In [82]:
bank_complaints["complaint_type"].isnull().sum()

2906

In [83]:
bank_complaints["complaint_type"] = bank_complaints["complaint_type"].fillna("Other") #3

In [84]:
bank_complaints["complaint_type"].isnull().sum()

0

In [85]:
bank_complaints["status"].value_counts()

status
pending        1719
Resolved       1644
resolved       1608
in_progress    1601
Name: count, dtype: int64

In [86]:
bank_complaints["status"] = bank_complaints["status"].str.strip().str.title() #4

In [87]:
bank_complaints["status"].value_counts()

status
Resolved       3252
Pending        1719
In_Progress    1601
Name: count, dtype: int64

In [88]:
bank_complaints["status"].isnull().sum()

3428

In [89]:
bank_complaints.isnull().sum()

complaint_id         0
customer_id          0
complaint_type       0
complaint_date       0
status            3428
dtype: int64

In [90]:
bank_complaints["status"] = bank_complaints["status"].fillna("Unknown") #5